
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/yuita-yoshihiko/aws-ecs-terraform/actions/runs/5827221532)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06b8f27414d1cabf8]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0a8087efaf3b54d8d]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07392b2be2d18bf9c]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0f0f5a7e5cce06140]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b80ac677bb33214f]
aws_security_group.alb: Refreshing state... [id=sg-0a9d386fe1969d674]
aws_security_group.ecs: Refreshing state... [id=sg-09dad8cc25e0acaa1]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-010c2c0524b144700]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f92484e7b5c3bc3d]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0edd855a902645cb0]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a7f1b532514522c6]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-08194cb55181a78fe]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00f719498d88461c4]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0480925e51e99cc7a]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0daa3d3bd23fdf220]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0a33747bcbdddeb0b]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3202176488]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0cef5de48e279d15c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e0b546d722c0f501]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01957416a0ca6bf21]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-04f73d7f394b158f8]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00f719498d88461c41080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-070a6a32772284545]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-022cca83687a69979]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-08194cb55181a78fe1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0480925e51e99cc7a1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-simple-server-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-0a9d386fe1969d674",
        ]
      + subnets                                     = [
          + "subnet-0a7f1b532514522c6",
          + "subnet-0f92484e7b5c3bc3d",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-06b8f27414d1cabf8"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:469112528302:targetgroup/go-simple-server-target-group/625447b11a80fc4c]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Creation complete after 2m14s [id=arn:aws:elasticloadbalancing:ap-northeast-1:469112528302:loadbalancer/app/go-simple-server-alb/dc64aee3ed3d3134]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:469112528302:listener/app/go-simple-server-alb/dc64aee3ed3d3134/652045111d449a67]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:469112528302:listener-rule/app/go-simple-server-alb/dc64aee3ed3d3134/652045111d449a67/335a8907ba45f676]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"c4a1e474b1a374a811c1ba39bcf2cd337aa1fe2c","Vars":{},"WorkflowName":"Terraform"} -->